Repository: NaN-tic/trytond-production_output_lot
Catalog: locale/*.po
Languages: ca, es

# error:production:
source: The "When Output Lot is created?" or "Output Lot Sequence" Production configuration params are empty.
es: No se han establecido los parámetros de la configuración de la producción "¿Cuando se crean los lotes de salida?" o "Secuencia lotes salida".

# error:stock.move:
source: There is not output lot sequence defined. Please define one in production configuration.
es: No se ha definido ninguna secuencia de lotes de salida. Por favor, defina una en la configuración de producción.

# field:production.configuration,output_lot_creation:
source: When Output Lot is created?
ca: Quan es creen els lots de sortida?
es: ¿Cuando se crean los lotes de salida?

# field:production.configuration,output_lot_sequence:
source: Output Lot Sequence
ca: Seqüència lots de sortida
es: Secuencia lotes de salida

# field:production.configuration.company,company:
source: Company
ca: Empresa
es: Empresa

# field:production.configuration.company,create_date:
source: Create Date
es: Fecha creación

# field:production.configuration.company,create_uid:
source: Create User
es: Usuario creación

# field:production.configuration.company,id:
source: ID
es: Identificador

# field:production.configuration.company,output_lot_creation:
source: When Output Lot is created?
ca: Quan es creen els lots de sortida?
es: ¿Cuando se crean los lotes de salida?

# field:production.configuration.company,output_lot_sequence:
source: Output Lot Sequence
ca: Seqüència lots de sortida
es: Secuencia lotes de salida

# field:production.configuration.company,rec_name:
source: Name
es: Nombre

# field:production.configuration.company,write_date:
source: Write Date
es: Fecha modificación

# field:production.configuration.company,write_uid:
source: Write User
es: Usuario modificación

# help:production.configuration,output_lot_creation:
source: The Production's state in which the Output Lot will be created automatically, if the Output Product is configured to require lot in production.
ca: L'estat de la producció en el qual es crearan els lots de sortida per aquells productes configurats per requerir lot a la producció.
es: El estado de la producción en el cual se crearán automáticamente los lotes de salida, si el producto está configurado para requerir lotes en la producción.

# model:production.configuration.company,name:
source: Production Configuration by Company
ca: Configuración de la producció per empresa
es: Configuración producción por empresa

# selection:production.configuration,output_lot_creation:
source: Production in Running
ca: Producció en curs
es: Producción en ejecución

# selection:production.configuration,output_lot_creation:
source: Production is Done
ca: Producció realitzada
es: Producción realizada

# selection:production.configuration.company,output_lot_creation:
source: Production in Running
ca: Producció en curs
es: Producción en ejecución

# selection:production.configuration.company,output_lot_creation:
source: Production is Done
ca: Producció realitzada
es: Producción realizada

# field:production.bom.input,use_lot:
source: Use Lot
ca: Utilitzar lot

# model:ir.message,text:missing_output_lot_creation_config
source: The "When Output Lot is created?" or "Output Lot Sequence" Production configuration params are empty.
ca: Els paràmetres de configuració de producció "Quan es crea el lot de sortida?" o "Seqüència de lot de sortida" estan buits.

# model:ir.message,text:more_than_one_input_lots
source: There is more than one lot in inputs. Please check input moves.
ca: Hi ha més d'un lot en les entrades. Si us plau verifiqui els moviments d'entrada.

# model:ir.message,text:no_sequence
source: There is not output lot sequence defined. Please define one in production configuration.
ca: No hi ha seqüència de lot de sortida definida. Si us plau defineixi una en la configuració de producció.

# model:ir.message,text:unique_use_lot_in_bom
source: Only one input product can have the option to use lot marked.
ca: Només un producte d'entrada pot tenir l'opció d'usar el lot marcat.
